backend/artillery/hello-world-load-test.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://nginx/api
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 20
      name: Spike phase
scenarios:
  - name: Get hello world
    flow:
      - loop:
          - get:
              url: '/'
        count: 100